// Сформируйте в программе следующий массив:
//char str_1[] = "Structures data";
//Создайте в программе еще один массив символов с именем str_2 и
//длиной 20. Скопируйте содержимое массива str_1 в массив str_2.
//P.S. На экран ничего выводить не нужно, только сформировать массивы в соответствии с заданием.
#include <iostream>

int main(void)
{
    using namespace std;
    // здесь пишите программу
    const int len = 7;
    char ar[len];
    for (
    __assertion_tests(ar);    // эту строчку не убирать (должна стоять перед return 0)
    return 0;
}
