//Пусть массив с целочисленными значениями содержит оценки студента:
//char marks[] = {5, 4, 2, 2, 2, 3};
//Вычислите среднее арифметическое этих оценок и сохраните результат в вещественной переменной
//(типа double) с именем m_avr.
//P.S. На экран ничего выводить не нужно, только сформировать массив и вычислить значение
//переменной m_avr в соответствии с заданием.
#include <iostream>

int main(void)
{
    using namespace std;
    // здесь пишите программу

    __assertion_tests(marks, m_avr);    // эту строчку не убирать (должна стоять перед return 0)
    return 0;
}
