//Создайте в программе следующий статический массив:
//short digits[] = {5, -4, 3, 10, 2, 7, 9, 2};
//Выполните удаление в этом массиве значения 3 так, чтобы массив digits содержал значения:
//{5, -4, 10, 2, 7, 9, 2, x}
//где x - любое число (можно оставить прежнее 2).
//P.S. На экран ничего выводить не нужно, только сформировать массив в соответствии с заданием.
#include <iostream>

int main(void)
{
    using namespace std;
    // здесь пишите программу

    __assertion_tests(func);    // эту строчку не убирать (должна стоять перед return 0)
    return 0;
}
