//Пусть массив с целочисленными значениями описывает вектор в 3-х мерном пространстве:
//int vector3D[3];
//Запишите в этот вектор координаты (15, 4, -5). Вычислите квадратичную норму этого вектора по формуле:
//res = x^2 + y^2 + z^2
//где x, y, z - координаты трехмерного вектора. Результат расчета сохраните в целочисленной
// переменной norm2. Выведите ее значение в консоль (можно воспользоваться командой cout << norm2).
#include <iostream>

int main(void)
{
    using namespace std;
    // здесь пишите программу

    __assertion_tests(vector3D, norm2);    // эту строчку не убирать (должна стоять перед return 0)
    return 0;
}
