"""
Название  ------   Описание


 random  -------   Возвращает случайное вещественное число в промежутке от 0 до 1.

 uniform  ------   Возвращает случайное вещественное число в указанном промежутке.

 randint  ------   Возвращает случайное целое число в пределах заданного промежутка.

 randrange  ----   Возвращает случайное целое число в пределах заданного промежутка (можно указать шаг).

 gauss  --------   Возвращает случайное вещественное число, основываясь на Гауссовом распределении.

 choice  -------   Возвращает случайный элемент из заданной последовательности.

 shuffle  ------   Перемешивает элементы случайным образом (работает только с изменяемыми объектами).

 sample  -------   Возвращает новый список со случайным выбором неповторяющихся элементов (2-м аргументом нужно указать длину нового списка).

 seed  ---------   При запуске программы результат изменяться не будет (нужно указать начальное числовое значение).

"""
